test/multiphase/multiphaseEulerFoam/populationBalance/coalescence/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type populationBalanceMultiphaseSystem;

phases (air1 air2 air3 water);

populationBalances (bubbles);

air1
{
    type            pureIsothermalPhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance   bubbles;

        shapeModel          spherical;

        sizeGroups
        (
            f0 {dSph 2.6472201610E-02; value 5.0000000000E-10;}
            f1 {dSph 2.8516314790E-02; value 2.0000000000E-10;}
            f2 {dSph 3.0718268709E-02; value 4.0000000000E-10;}
            f3 {dSph 3.3090252012E-02; value 8.0000000000E-10;}
            f4 {dSph 3.5645392557E-02; value 1.5000000000E-09;}
            f5 {dSph 3.8397835576E-02; value 2.9000000000E-09;}
            f6 {dSph 4.1362814395E-02; value 5.7000000000E-09;}
            f7 {dSph 4.4556741007E-02; value 1.1000000000E-08;}
            f8 {dSph 4.7997294160E-02; value 2.1500000000E-08;}
            f9 {dSph 5.1703518614E-02; value 4.2000000000E-08;}
            f10{dSph 5.5695926879E-02; value 8.1900000000E-08;}
            f11{dSph 5.9996618320E-02; value 1.5950000000E-07;}
            f12{dSph 6.4629397027E-02; value 3.1070000000E-07;}
            f13{dSph 6.9619908288E-02; value 6.0460000000E-07;}
            f14{dSph 7.4995772590E-02; value 1.1757000000E-06;}
            f15{dSph 8.0786746904E-02; value 2.2836000000E-06;}
            f16{dSph 8.7024884740E-02; value 4.4295000000E-06;}
            f17{dSph 9.3744716047E-02; value 8.5770000000E-06;}
            f18{dSph 1.0098343332E-01; value 1.6572400000E-05;}
            f19{dSph 1.0878110624E-01; value 3.1934500000E-05;}
            f20{dSph 1.1718089506E-01; value 6.1329900000E-05;}
            f21{dSph 1.2622929258E-01; value 1.1728840000E-04;}
            f22{dSph 1.3597638341E-01; value 2.2312640000E-04;}
            f23{dSph 1.4647611820E-01; value 4.2168510000E-04;}
            f24{dSph 1.5778661510E-01; value 7.9041010000E-04;}
            f25{dSph 1.6997047865E-01; value 1.4663924000E-03;}
            f26{dSph 1.8309514838E-01; value 2.6857456000E-03;}
            f27{dSph 1.9723326857E-01; value 4.8406166000E-03;}
            f28{dSph 2.1246309893E-01; value 8.5509222000E-03;}
            f29{dSph 2.2886893516E-01; value 1.4730611700E-02;}
            f30{dSph 2.4654158664E-01; value 2.4592238100E-02;}
            f31{dSph 2.6557887273E-01; value 3.9476363300E-02;}
            f32{dSph 2.8608616864E-01; value 6.0336272800E-02;}
            f33{dSph 3.0817698237E-01; value 8.6735651800E-02;}
            f34{dSph 3.3197359122E-01; value 1.1548859450E-01;}
            f35{dSph 3.5760771049E-01; value 1.3972798580E-01;}
            f36{dSph 3.8522122921E-01; value 1.4997928090E-01;}
            f37{dSph 4.1496698934E-01; value 1.3860649860E-01;}
            f38{dSph 4.4700963811E-01; value 1.0624083860E-01;}
            f39{dSph 4.8152653620E-01; value 6.4453106200E-02;}
            f40{dSph 5.1870873668E-01; value 2.9191189700E-02;}
            f41{dSph 5.5876204826E-01; value 9.1744326000E-03;}
            f42{dSph 6.0190816932E-01; value 1.8262321000E-03;}
            f43{dSph 6.4838592116E-01; value 2.0539720000E-04;}
            f44{dSph 6.9845255939E-01; value 1.1316400000E-05;}
            f45{dSph 7.5238521196E-01; value 2.5550000000E-07;}
            f46{dSph 8.1048240020E-01; value 1.9000000000E-09;}

        );
    }

    residualAlpha   1e-6;
}

air2
{
    type            pureIsothermalPhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance   bubbles;

        shapeModel          spherical;

        sizeGroups
        (
            f47{dSph 8.7306570017E-01; value 1.0000000000E+00;}
            f48{dSph 9.4048151557E-01; value 0.0000000000E+00;}
            f49{dSph 1.0131030009E+00; value 0.0000000000E+00;}
            f50{dSph 1.0913321246E+00; value 0.0000000000E+00;}
            f51{dSph 1.1756018938E+00; value 0.0000000000E+00;}
            f52{dSph 1.2663787514E+00; value 0.0000000000E+00;}
            f53{dSph 1.3641651564E+00; value 0.0000000000E+00;}
            f54{dSph 1.4695023670E+00; value 0.0000000000E+00;}
            f55{dSph 1.5829734383E+00; value 0.0000000000E+00;}
        );
    }

    residualAlpha   1e-6;
}

air3
{
    type            pureIsothermalPhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance   bubbles;

        shapeModel          spherical;

        sizeGroups
        (
            f56{dSph 1.7052064454E+00; value 1.0000000000E+00;}
            f57{dSph 1.8368779600E+00; value 0.0000000000E+00;}
            f58{dSph 1.9787167982E+00; value 0.0000000000E+00;}
            f59{dSph 2.1315080559E+00; value 0.0000000000E+00;}
            f60{dSph 2.2960974494E+00; value 0.0000000000E+00;}
            f61{dSph 2.4733959981E+00; value 0.0000000000E+00;}
            f62{dSph 2.6643850705E+00; value 0.0000000000E+00;}
            f63{dSph 2.8701218120E+00; value 0.0000000000E+00;}
            f64{dSph 3.0917449976E+00; value 0.0000000000E+00;}
            f65{dSph 3.3304813381E+00; value 0.0000000000E+00;}
            f66{dSph 3.5876522644E+00; value 0.0000000000E+00;}
            f67{dSph 3.8646812476E+00; value 0.0000000000E+00;}
            f68{dSph 4.1631016726E+00; value 0.0000000000E+00;}
            f69{dSph 4.4845653305E+00; value 0.0000000000E+00;}
            f70{dSph 4.8308515589E+00; value 0.0000000000E+00;}
        );
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;
    diameterModel   constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha   1e-6;
}

populationBalanceCoeffs
{
    bubbles
    {
        continuousPhase water;

        coalescenceModels
        (
            constant
            {
                rate 1.0;
            }
        );

        binaryBreakupModels
        ();

        breakupModels
        ();

        driftModels
        ();

        nucleationModels
        ();
    }
}

blending
{
    default
    {
        type            none;
        continuousPhase water;
    }
}

surfaceTension
();

interfaceCompression
();

aspectRatio
();

drag
();

virtualMass
();

heatTransfer
();

phaseTransfer
();

lift
();

wallLubrication
();

turbulentDispersion
();

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
